---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeTypeOptions.Dispose
source: html/8c8c8c9d-b41a-a497-63a2-ff65afe5fe8f.htm
---
# Autodesk.Revit.DB.DirectShapeTypeOptions.Dispose Method

Releases all resources used by the DirectShapeTypeOptions

## Syntax (C#)
```csharp
public void Dispose()
```